benchmark/leveldb/results/micro/mris_seq_wt_ssd.1.log
LevelDB:    version 1.5
Date:       Sat Dec  1 15:22:43 2012
CPU:        1 * Intel(R) Xeon(TM) CPU 2.80GHz
CPUCache:   2048 KB
./table/mris.h:637: [mris] Failed to open /mnt/largespace/mris_seq_wt_db
Keys:       16 bytes each
Values:     2 resolutions
            8196 byte (8196 after compression)
            131072 byte (131072 after compression)
Entries:    10000
RawSize:    0.13 MB (estimated)
FileSize:   0.13 MB (estimated)
WARNING: Snappy compression is not enabled
------------------------------------------------
----- /mnt/largespace/mris_seq_wt_db statistics: -----
nr_new_large_values_ 	0
nr_success_lookups_ 	0
nr_failed_lookups_ 	0
nr_failed_inserts_ 	0
mris_seq_wt  :    1709.281 micros/op;   38.9 MB/s
Microseconds per op:
Count: 20000  Average: 1708.9046  StdDev: 5462.79
Min: 116.0000  Median: 679.2952  Max: 216259.0000
------------------------------------------------------
[     100,     120 )      57   0.285%   0.285% 
[     120,     140 )    8319  41.595%  41.880% ########
[     140,     160 )     828   4.140%  46.020% #
[     160,     180 )     145   0.725%  46.745% 
[     180,     200 )     214   1.070%  47.815% 
[     200,     250 )      60   0.300%  48.115% 
[     250,     300 )       4   0.020%  48.135% 
[     300,     350 )       3   0.015%  48.150% 
[     350,     400 )       8   0.040%  48.190% 
[     400,     450 )       1   0.005%  48.195% 
[     500,     600 )       1   0.005%  48.200% 
[     600,     700 )     454   2.270%  50.470% 
[     700,     800 )    1108   5.540%  56.010% #
[     800,     900 )    3972  19.860%  75.870% ####
[     900,    1000 )     199   0.995%  76.865% 
[    1000,    1200 )     831   4.155%  81.020% #
[    1200,    1400 )     667   3.335%  84.355% #
[    1400,    1600 )     201   1.005%  85.360% 
[    1600,    1800 )      27   0.135%  85.495% 
[    1800,    2000 )       4   0.020%  85.515% 
[    2000,    2500 )      75   0.375%  85.890% 
[    2500,    3000 )      38   0.190%  86.080% 
[    3000,    3500 )      48   0.240%  86.320% 
[    3500,    4000 )      53   0.265%  86.585% 
[    4000,    4500 )     370   1.850%  88.435% 
[    4500,    5000 )    1084   5.420%  93.855% #
[    5000,    6000 )     623   3.115%  96.970% #
[    6000,    7000 )     172   0.860%  97.830% 
[    7000,    8000 )      74   0.370%  98.200% 
[    8000,    9000 )      32   0.160%  98.360% 
[    9000,   10000 )       3   0.015%  98.375% 
[   10000,   12000 )       2   0.010%  98.385% 
[   12000,   14000 )       1   0.005%  98.390% 
[   30000,   35000 )       1   0.005%  98.395% 
[   35000,   40000 )     101   0.505%  98.900% 
[   40000,   45000 )     217   1.085%  99.985% 
[   45000,   50000 )       2   0.010%  99.995% 
[  200000,  250000 )       1   0.005% 100.000%