benchmark/leveldb/results/micro/mris_seq_wt_ssd.2.log
LevelDB:    version 1.5
Date:       Sat Dec  1 15:23:19 2012
CPU:        1 * Intel(R) Xeon(TM) CPU 2.80GHz
CPUCache:   2048 KB
./table/mris.h:637: [mris] Failed to open /mnt/largespace/mris_seq_wt_db
Keys:       16 bytes each
Values:     2 resolutions
            8196 byte (8196 after compression)
            131072 byte (131072 after compression)
Entries:    10000
RawSize:    0.13 MB (estimated)
FileSize:   0.13 MB (estimated)
WARNING: Snappy compression is not enabled
------------------------------------------------
----- /mnt/largespace/mris_seq_wt_db statistics: -----
nr_new_large_values_ 	0
nr_success_lookups_ 	0
nr_failed_lookups_ 	0
nr_failed_inserts_ 	0
mris_seq_wt  :    1701.088 micros/op;   39.0 MB/s
Microseconds per op:
Count: 20000  Average: 1700.7438  StdDev: 5516.88
Min: 117.0000  Median: 679.2941  Max: 225854.0000
------------------------------------------------------
[     100,     120 )      43   0.215%   0.215% 
[     120,     140 )    8371  41.855%  42.070% ########
[     140,     160 )     841   4.205%  46.275% #
[     160,     180 )     128   0.640%  46.915% 
[     180,     200 )     211   1.055%  47.970% 
[     200,     250 )      57   0.285%  48.255% 
[     250,     300 )       2   0.010%  48.265% 
[     300,     350 )       1   0.005%  48.270% 
[     350,     400 )       9   0.045%  48.315% 
[     600,     700 )     425   2.125%  50.440% 
[     700,     800 )    1116   5.580%  56.020% #
[     800,     900 )    4042  20.210%  76.230% ####
[     900,    1000 )     179   0.895%  77.125% 
[    1000,    1200 )     818   4.090%  81.215% #
[    1200,    1400 )     672   3.360%  84.575% #
[    1400,    1600 )     174   0.870%  85.445% 
[    1600,    1800 )      27   0.135%  85.580% 
[    1800,    2000 )       6   0.030%  85.610% 
[    2000,    2500 )      76   0.380%  85.990% 
[    2500,    3000 )      43   0.215%  86.205% 
[    3000,    3500 )      44   0.220%  86.425% 
[    3500,    4000 )      42   0.210%  86.635% 
[    4000,    4500 )     346   1.730%  88.365% 
[    4500,    5000 )    1214   6.070%  94.435% #
[    5000,    6000 )     591   2.955%  97.390% #
[    6000,    7000 )     112   0.560%  97.950% 
[    7000,    8000 )      65   0.325%  98.275% 
[    8000,    9000 )      18   0.090%  98.365% 
[    9000,   10000 )       5   0.025%  98.390% 
[   35000,   40000 )      85   0.425%  98.815% 
[   40000,   45000 )     226   1.130%  99.945% 
[   45000,   50000 )       4   0.020%  99.965% 
[   50000,   60000 )       6   0.030%  99.995% 
[  200000,  250000 )       1   0.005% 100.000%